10/data/attachments/8b1cd7700dc2a7a8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a0190080-e586-4dc7-b364-b59b2cc15082</nif:username>
            <nif:friendToBeAdded>Sarah_two_Friend_69888_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>